{
  "name": "Miraleth T'alzar",
  "size": "Small",
  "type": "humanoid (drow, sorcerer)",
  "alignment": "",
  "cr": "1/8",
  "ac": {
    "value": 17,
    "notes": "Natural Armor (13 + DEX 3) and Amulet of Warding (+1)"
  },
  "hp": {
    "average": 8,
    "formula": "1d6 + 2"
  },
  "speed": "30 ft.",
  "abilities": {
    "str": 8, 
    "dex": 16, 
    "con": 14, 
    "int": 13, 
    "wis": 10, 
    "cha": 16 
  },
  "pb": "+2",
  "saves": {
    "con": "+4",
    "cha": "+5"
  },
  "skills": {
    "performance": "+5",
    "stealth": "+5",
    "insight": "+2"
  },
  "senses": "darkvision 120 ft., passive Perception 10",
  "languages": "Common, Elvish, Undercommon",
  "spellcasting_ability": "Charisma",
  "caster_level": 1,
  "spell_slots": {
    "1": 2
  },
  "spells": {
    "cantrips": ["Fire Bolt", "Mage Hand", "Prestidigitation"],
    "level1": ["Chaos Bolt", "Shield"]
  },
  "traits": [
    {
      "name": "Fey Ancestry",
      "desc": "Miraleth has advantage on saving throws against being charmed, and magic can't put her to sleep."
    },
    {
      "name": "Sunlight Sensitivity",
      "desc": "While in sunlight, Miraleth has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
    },
    {
      "name": "Drow Magic",
      "desc": "Miraleth can cast the Dancing Lights cantrip at will (CHA is her spellcasting ability for it)."
    },
    {
      "name": "Natural Resilience",
      "desc": "Miraleth's hit point maximum increases by 1, and while not wearing armor, her AC equals 13 + her Dexterity modifier."
    },
    {
      "name": "Wild Magic Affinity",
      "desc": "When Miraleth is frightened or excited, harmless magical sparks appear around her."
    },
    {
      "name": "Spellcasting (Sorcerer)",
      "desc": "Miraleth is a 1st-level spellcaster. Her spellcasting ability is Charisma (spell save DC 13, +5 to hit with spell attacks). She knows the following sorcerer spells:\n\nCantrips (at will): Fire Bolt, Mage Hand, Prestidigitation\n1st Level (2 slots): Chaos Bolt, Shield"
    }
  ],
  "equipment": [
    {
      "name": "Amulet of Warding",
      "desc": "+1 AC while worn; once per long rest, Miraleth can use a reaction to cast Shield on herself."
    },
    {
      "name": "Clockwork Spider Companion",
      "desc": "Tiny construct (AC 13, 1 HP, 20 ft. climb). As a reaction once per long rest, it can skitter across an enemy's hand and impose disadvantage on one attack roll that targets Miraleth."
    }
  ],
  "actions": [
    {
      "name": "Fire Bolt",
      "attack": {
        "type": "Ranged Spell Attack",
        "tohit": "+5",
        "range": "120 ft.",
        "target": "one target",
        "dmg1": "1d10",
        "type1": "fire"
      },
      "desc": "Spell attack; ignites flammable objects that aren't being worn or carried."
    }
  ],
  "bio": "Miraleth is bright-eyed, affectionate, and endlessly curious. Her wild magic blood shows in her unusual warmth and the magical energy that seems to follow her moods: candles flare when she laughs, and harmless sparks dance when she startles. She is slow to anger, but an insult to her family can earn a sudden, fiery retort—always followed by an apologetic blush. In play, emphasise her sentimentality (she clings to keepsakes), her wish to be helpful, and the protective instincts she inspires in those around her. She will never start combat, but if pressed will hurl a nervous Fire Bolt—then hide behind the nearest PC."
}